# -*- coding:utf-8 -*-
#date:  10/4/2017

menu = {
    '北京':{
        '东城区':{
            '东1区':{},
            '东2区':{},
            '东3区':{},
        },
        '西城区':{
            '西1区':{},
            '西2区':{},
            '西3区':{},
        },
        '海淀区':{
            '海1区':{},
            '海2区':{},
            '海3区':{},
        }
    },
    '上海':{
        '浦东':{
            '浦东1区':{},
            '浦东2区':{},
            '浦东3区':{},
        },
        '浦西':{
            '浦西1区':{},
            '浦西2区':{},
            '浦西3区':{},
        },
        '虹桥':{
            '虹1区':{},
            '虹2区':{},
            '虹3区':{},
        },
    },
    '苏州':{
        '园区':{
            '湖西':{},
            '湖东':{},
            '胜浦':{},
        },
        '新区':{
            '枫桥':{},
            '横泾':{},
            '木渎':{},
        },
        '姑苏':{
            '葑门':{},
            '娄门':{},
            '阊站':{},
        },
    },
}

while True:
    for k in menu:
        print(k)
    choice = input("Please choose:").strip()

    if choice in menu:
        while True:
            for k2 in menu[choice]:
                print(k2)
            choice2 = input("Please choose:").strip()



